scottmsilver/precor-9.3x/hardware/Esp32Tap/firmware/esp32_rs/sdkconfig.defaults
# --- Slice 3: mDNS. The component itself is pulled in as a remote (managed)
# component from esp32tap/Cargo.toml — see the long note there. These are its
# knobs.
#
# The console CLI defaults to y and drags the `console` component (and an
# argtable/linenoise-shaped surface) into an image whose only job is to answer
# DNS-SD queries. There is no UART shell on this device; refuse it.
# CONFIG_MDNS_ENABLE_CONSOLE_CLI is not set
# One netif (ETH today, WiFi later) — the default of 3 sizes per-interface
# state we will never use.
CONFIG_MDNS_MAX_INTERFACES=1
#
# PREDEFINED INTERFACES OFF — and this is a CORRECTNESS fix, not a diet.
#
# With the predefs on, the component learns about an interface ONLY from an
# event: `mdns_preset_if_handle_system_event` enables the PCB when it sees
# ETHERNET_EVENT_CONNECTED / IP_EVENT_ETH_GOT_IP. The firmware brings the link
# up and waits for DHCP BEFORE it starts mDNS (a record must not advertise an
# address the device does not have yet), so those events have already fired by
# the time `mdns_init` registers the handler. The result is a responder that
# starts, logs success, answers `mdns_service_add` with ESP_OK — and never
# replies to a single query, because no PCB was ever enabled. That is exactly
# the failure this cost a debugging cycle to find, and it is silent.
#
# With the predefs off, `MDNS_MAX_INTERFACES` slots are all CUSTOM, so
# net/mdns.rs registers ETH_DEF explicitly and drives ENABLE_IP4/ANNOUNCE_IP4
# itself. That works whatever order the link and the responder come up in, and
# it says in the source which interface serves discovery — which matters when
# this board moves from openeth to WiFi.
# CONFIG_MDNS_PREDEF_NETIF_STA is not set
# CONFIG_MDNS_PREDEF_NETIF_AP is not set
# CONFIG_MDNS_PREDEF_NETIF_ETH is not set

# --- 8 MB layout with a data partition (added 2026-07-28) ---
#
# The note above said the 8 MB N8 table comes back "if the port ever grows a
# data partition". It has: the persistence tier needs the `storage` partition
# at 0x210000, which does not exist under the stock 2 MB table — the image
# carried only `factory` and `nvs`, and esp_partition_find_first("storage")
# returned null, so every store probe answered no_partition.
#
# The FILENAME MUST BE ABSOLUTE — the sharp edge documented above. idf.py
# resolves a relative path against the project dir, but esp-idf-sys generates
# its own CMake project under target/.../esp-idf-sys-<HASH>/out/ and resolves
# against THAT, and <HASH> is not knowable in advance. tools/build.sh always
# bind-mounts the worktree at /project, so this path is stable.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="/project/hardware/Esp32Tap/firmware/esp32_rs/partitions_esp32tap.csv"

# --- Slice 6: BLE (NimBLE). --------------------------------------------------
#
# TWO KEYS ARE THE WHOLE ENABLEMENT, and they were found by READING rather than
# probing — esp-idf-sys 0.37's own src/include/esp-idf/bindings.h gates the
# NimBLE headers on exactly `CONFIG_BT_ENABLED` plus `CONFIG_BT_NIMBLE_ENABLED`
# (and excludes only S2/P4, so the S3 is fine). BUILD-OPTIONS.md does NOT
# document them; it points at `cargo pio espidf menuconfig`, which applies to
# the `pio` builder and not the `native` one this port uses.
#
# NO `extra_components` AND NO `bindings_header` ARE NEEDED, and that is not an
# oversight — it is the mDNS lesson applied in reverse. mDNS needed
# `extra_components` because it is a MANAGED (remote) component outside base
# ESP-IDF. `bt` is a BASE component, compiled by the native builder's own CMake
# tree and gated purely by Kconfig, exactly like `esp_https_server` above:
# turning the symbol on is sufficient to make `nimble_port_*`, `ble_hs_*`,
# `ble_gap_*`, `ble_gatts_*` and `ble_gattc_*` appear in the generated bindings.
CONFIG_BT_ENABLED=y
# Bluedroid is the DEFAULT stack when BT is enabled and it is the wrong one:
# it is a Kconfig `choice`, so naming NimBLE selects it, and the explicit
# negative below makes the intent unmissable to anyone reading this file.
# CONFIG_BT_BLUEDROID_ENABLED is not set
CONFIG_BT_NIMBLE_ENABLED=y
#
# TWO connections, not the IDF default of 3. This device needs exactly two: one
# inbound (a fitness app on the FTMS peripheral) and one outbound (a heart-rate
# strap on the central). Each slot costs controller and host memory whether or
# not it is used, and "resident memory must not move with connection count"
# starts with bounding the count.
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=2
# The FTMS Treadmill Data value is 13 bytes and an HR Measurement is 2-3, so
# nothing here needs a large MTU. The default (256) buys a bigger msys pool for
# no benefit; 128 still clears every payload this firmware sends or receives
# with room to spare.
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=128
#
# THE NIMBLE HOST TASK'S STACK, SIZED RATHER THAN DEFAULTED.
#
# This key was absent, so the build took the IDF default of 4096 B — and that
# is the ONE task in this firmware whose stack was never sized, while being the
# task with the DEEPEST UNTRUSTED CALL CHAIN. Everything a radio peer can reach
# runs on it: `access_cb` -> `on_control_point` -> `plan` -> `apply` ->
# `control::command` -> `SafetyController::command_motion` + `request_emulate`
# + `apply_outputs` (GPIO), plus `stop_the_belt`'s program-lock path, plus
# `treadmill_data()` and all five `central.rs` discovery callbacks.
#
# Every other task in this tree has its arithmetic written down (see the
# normative matrix in tasks/mod.rs: serial_engine 8192, emulate_cycle 6144,
# interval_exec 16384, session 12288). That discipline exists BECAUSE the httpd
# task already overflowed its stack on POST /history/{id}/resume and silently
# rebooted (commit a055117) — and a reboot drops the relay mid-run.
#
# THE ARITHMETIC, worst case, one Control Point write:
#   NimBLE host internals (HCI event dispatch, L2CAP, ATT/GATT,
#     os_mbuf chain walking) — what the 4096 default exists to cover ~2500 B
#   access_cb frame + the CP_MAX=20 bounded copy                      ~100 B
#   on_control_point -> plan -> apply -> stop_the_belt                ~400 B
#   control::command -> command_motion / request_emulate              ~350 B
#   apply_outputs (GPIO writes through the HAL)                       ~150 B
#   logging: log_fmt's FixedStr<192> + write_line's SECOND
#     FixedStr<192> + [u8;193], all live at once                      ~600 B
#   esp_log_write -> vsnprintf into the console driver                ~500 B
#                                                              total ~4600 B
# That is already OVER the 4096 default before any margin, which is the whole
# point: the overflow was reachable by an unauthenticated peer in radio range
# writing 3 bytes. 8192 matches the serial engine and leaves ~44% headroom.
#
# THE NUMBER IS NOT LEFT AS ARITHMETIC. `ble::ftms::on_control_point` samples
# uxTaskGetStackHighWaterMark on this task after every write and logs
# `ble: host task stack low-water N bytes` whenever a NEW minimum is reached,
# so the first real board replaces this estimate with a measurement. Bead
# precor-9_3x-l0h.
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=8192

# --- Persistence: LittleFS over the `storage` partition ---------------------
#
# THE SIZES ARE STATED HERE BECAUSE THEY ARE RESIDENT MEMORY, not tuning. Every
# one of these is a buffer littlefs holds for the life of the mount, and the
# tier this replaced (`recstore`) held 200 bytes total — so the cost of using a
# real filesystem is exactly what these lines add. See net/store.rs, which
# MEASURES the total at mount and reports it through `QT store_stat`, rather
# than leaving this arithmetic as the claim.
#
# The buffers, per mount: one read cache (CACHE_SIZE), one program cache
# (CACHE_SIZE) and one lookahead bitmap (LOOKAHEAD_SIZE), plus `lfs_t` and the
# esp_littlefs wrapper. Each OPEN FILE additionally costs CACHE_SIZE, and this
# firmware opens exactly one at a time and closes it before it returns.
#
# CACHE_SIZE=128 rather than the component's 512: littlefs requires
# `cache_size % read_size == 0` and `block_size % cache_size == 0`, so 128 is
# the smallest legal value at READ/WRITE_SIZE=128 and it saves 384 bytes on
# each of the two mount caches AND on every open file. A record here is under
# 1 KB, so the extra block reads a small cache costs are invisible next to a
# 4 KB sector erase.
CONFIG_LITTLEFS_READ_SIZE=128
CONFIG_LITTLEFS_WRITE_SIZE=128
CONFIG_LITTLEFS_CACHE_SIZE=128
#
# LOOKAHEAD=32 IS SIZED TO THE PARTITION, not defaulted. The lookahead buffer
# is a bitmap of free blocks at 8 blocks per byte; the `storage` partition is
# 1 MB of 4 KB blocks = 256 blocks = exactly 32 bytes. The component's default
# of 128 would reserve 96 bytes to describe blocks that do not exist.
CONFIG_LITTLEFS_LOOKAHEAD_SIZE=32
#
# One partition is mounted, so do not reserve slots for three.
CONFIG_LITTLEFS_MAX_PARTITIONS=1
#
# BLOCK_CYCLES IS THE WEAR KNOB, so it is stated rather than inherited. It is
# how many erase cycles littlefs allows a metadata block to take before it
# RELOCATES that block's contents elsewhere — i.e. it is dynamic wear
# levelling, and it is the single most wear-relevant setting in this component.
# 512 happens to be the component's default; it is written here because the
# block above claims to state the costs, and a defaulted wear setting inside a
# block that states everything else reads as an oversight.
#
# THE ERASE BUDGET THIS TIER ACTUALLY SPENDS, since the cadence is ours:
# net/session.rs checkpoints the in-progress run every 30 s into the SAME slot,
# so a 3-hour session is ~360 rewrites — the dominant write load on the device
# by an order of magnitude (history and workouts are user actions, a handful per
# session). Each rewrite is a copy-on-write data block plus one metadata commit
# in the mount root's pair, so ~400 erases per session against a 1 MB / 256-block
# partition. With relocation at 512 cycles those erases spread across the whole
# partition rather than pounding two blocks: ~1.6 erases per block per session,
# and a 100k-cycle NOR sector then survives tens of thousands of sessions —
# decades of daily use, with the assumption stated so a future cadence change
# (a 5 s checkpoint would be 6x this) has something to be checked against.
# net/store.rs::slot_equals is the other half of this bound and belongs in the
# same budget: a checkpoint whose numbers did not change (a paused session, a
# belt at zero) writes NOTHING, so an idle hour costs zero erases rather than
# 120 of them.
CONFIG_LITTLEFS_BLOCK_CYCLES=512
#
# NO MTIME. It costs 4 bytes per file on flash plus an attribute write on every
# commit, and it would be a LIE on this device: there is no RTC and no
# guarantee of NTP, so `time(NULL)` at the moment a run record is checkpointed
# is whatever the epoch says. Record ordering comes from an explicit sequence
# number in the record itself (net/store.rs) precisely so it does not depend on
# a clock this hardware does not have.
# CONFIG_LITTLEFS_USE_MTIME is not set
#
# NO SPIFFS COMPATIBILITY SHIM. It auto-creates parent directories on open and
# deletes them when they empty; this tier uses flat, fixed filenames at the
# mount root and wants an open of a name that is not there to FAIL rather than
# to conjure a path.
# CONFIG_LITTLEFS_SPIFFS_COMPAT is not set
#
# NO MMAP. Mapping 1 MB of flash into the address space to speed up a store
# that is read a few times per request is a poor trade on a part where the
# address space is the scarce thing.
# CONFIG_LITTLEFS_MMAP_PARTITION is not set
#
# NO WDT PETTING INSIDE FLASH OPERATIONS, and that is a safety decision rather
# than an oversight. CONFIG_LITTLEFS_WDT_RESET makes littlefs call
# esp_task_wdt_reset() during read/write/erase — i.e. it makes a stalled flash
# operation invisible to the watchdog. The task WDT here is 2 s with PANIC, and
# panic means reset means the relay is released; a store operation that cannot
# finish in 2 s is precisely the condition that must reach it. The longest
# thing this tier does on purpose is one 4 KB sector erase (~30 ms).
# CONFIG_LITTLEFS_WDT_RESET is not set
